"""Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
"""

my_list = [7, 5, 3, 3, 2]

while True:
    user_num = input('Введите число')
    if user_num.isdigit():
        user_num = int(user_num)
        break
    else:
        print('Это не число!')

is_insert = False
for num, tmp in enumerate(my_list):
    if tmp < user_num and is_insert == False:
        my_list.insert(num, user_num)
        is_insert = True

if is_insert == False:
    my_list.append(user_num)

print(my_list)
